# DataFrames 
Cotinued...

In [21]:
import pandas as pd
import numpy as np

rand = np.random.randint(1,100,(5,5))

In [22]:
rand

array([[58, 96, 76,  2, 95],
       [55, 99, 32, 39, 90],
       [95, 74,  9, 22, 86],
       [73, 72,  6, 79, 52],
       [43, 21, 74, 36, 58]])

In [23]:
cols = list('ABCDE')
rows = list('abcde')
DF = pd.DataFrame(rand, columns= cols, index= rows)

In [24]:
DF

    A   B   C   D   E
a  58  96  76   2  95
b  55  99  32  39  90
c  95  74   9  22  86
d  73  72   6  79  52
e  43  21  74  36  58

### Conditional Indexing

In [25]:
DF > 40

      A      B      C      D     E
a  True   True   True  False  True
b  True   True  False  False  True
c  True   True  False  False  True
d  True   True  False   True  True
e  True  False   True  False  True

In [26]:
DF[DF>40]

    A     B     C     D   E
a  58  96.0  76.0   NaN  95
b  55  99.0   NaN   NaN  90
c  95  74.0   NaN   NaN  86
d  73  72.0   NaN  79.0  52
e  43   NaN  74.0   NaN  58

    Commonly we would just use DF[Col/Row Condition] instead of Entire DF like this.

### 
From Column Condition

In [27]:
DF[DF['A'] > 60]

    A   B  C   D   E
c  95  74  9  22  86
d  73  72  6  79  52

### 
From Row Condition

In [50]:
DF[DF['a':'a'] > 40] #or DF[DF.iloc[0]] <--- Doesn't Work!

# ( Problem with Row indexing, With col it is done with iloc )

      A     B     C   D     E
a  58.0  96.0  76.0 NaN  95.0
b   NaN   NaN   NaN NaN   NaN
c   NaN   NaN   NaN NaN   NaN
d   NaN   NaN   NaN NaN   NaN
e   NaN   NaN   NaN NaN   NaN

# 
Stuff with MULTIPLE CONDITIONS

In [65]:
DF['A'] > 60 and DF['B'] > 40

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

## Called 'A Begginer ERROR! I am a Begginer' !
    Because a python operator can't be used to compare Series.
        >>>    DF['A'] > 30 and DF['B'] < 40 is wrong.

### Real way of doing this.

In [84]:
(DF['A'] > 40) & (DF['B'] <60)

a    False
b    False
c    False
d    False
e     True
dtype: bool

# PUT. FREAKING. BRACKETS!
( CONDITION ) & ( CONDITION )

####

####  __

# more INDEXING.

### Rest Index
    • With ---> DF.reset_index()

In [86]:
DF # Notice, indices are a,b,c,d,e.

    A   B   C   D   E
a  58  96  76   2  95
b  55  99  32  39  90
c  95  74   9  22  86
d  73  72   6  79  52
e  43  21  74  36  58

In [99]:
DF.reset_index() # Notice, now indices are 0,1,2,3,4

  index   A   B   C   D   E
0     a  58  96  76   2  95
1     b  55  99  32  39  90
2     c  95  74   9  22  86
3     d  73  72   6  79  52
4     e  43  21  74  36  58

Wa happened? Index has become a column!
    
    To avoid that use:
        >>>   drop=True
    Which is equal to:
        >>>   DF.reset_index().drop('index',axis=1)

### Set a Column as Index
    • With ---> DF.set_index()

In [100]:
DF.set_index('A')

     B   C   D   E
A
58  96  76   2  95
55  99  32  39  90
95  74   9  22  86
73  72   6  79  52
43  21  74  36  58

We don't usually set the index a values of that table, right?

    So, let's create column of labels then apply it.

In [106]:
new_lables = "Q1 Q2 Q3 Q4 Q5".split()
DF['labels'] = new_lables # <--- Here total rows are 5 and if we give
                          #      less or more elements, we will get an
                          #      error.

In [105]:
DF

    A   B   C   D   E labels
a  58  96  76   2  95     Q1
b  55  99  32  39  90     Q2
c  95  74   9  22  86     Q3
d  73  72   6  79  52     Q4
e  43  21  74  36  58     Q5

In [107]:
#Now,
DF.set_index('labels')

         A   B   C   D   E
labels
Q1      58  96  76   2  95
Q2      55  99  32  39  90
Q3      95  74   9  22  86
Q4      73  72   6  79  52
Q5      43  21  74  36  58

#### Simple as that.

    But who does that! 
    1> Create a list
    2> Make a column
    3> Then set.
    
    What if we can directly set the lables?
    Which doesn't give an error on less or more values?
    
    The solution is...
    
Covered in part 3